Revit 2024 API
RebarConstraint.TargetRebarConstraintTypeIsEdge Method
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool TargetRebarConstraintTypeIsEdge()
Visual Basic
Public Function TargetRebarConstraintTypeIsEdge As Boolean
Visual C++
public:
bool TargetRebarConstraintTypeIsEdge()
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace